Revit 2025 API
DigitGroupingSymbol Enumeration
 The symbol used to separate groups of digits when numbers are formatted with digit grouping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum DigitGroupingSymbol
Public Enumeration DigitGroupingSymbol
public enum class DigitGroupingSymbol
type DigitGroupingSymbol
Members
Member name | Value | Description
Dot | 0 |  A dot (".").
Comma | 1 |  A comma (",").
Space | 2 |  A space (" ").
Apostrophe | 3 |  An apostrophe ("'").
Tick | 3 |  An apostrophe ("'"). This value is deprecated in Revit 2015. Use DigitGroupingSymbol.Apostrophe instead.
See Also
Reference
Autodesk.Revit.DB Namespace